[
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "Ziba's food was delicious!  The butter chicken was especially flavorful, and the service was quick and friendly."
  },
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "The ambiance at Ziba Restaurant is quite pleasant, perfect for a family dinner.  However, the prices are a bit higher than other comparable restaurants in Adajan."
  },
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "I had a decent meal at Ziba, nothing extraordinary.  The portion sizes were good, but the taste was average."
  },
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "The service was incredibly slow, we waited ages for our food.  The food itself was okay, but the wait really soured the experience."
  },
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "Ziba Restaurant offers great value for money. The food was tasty and the portions were generous, making it a worthwhile experience."
  },
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "Absolutely loved the biryani at Ziba!  It was perfectly cooked and bursting with flavor. Highly recommend it!"
  },
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "The restaurant was quite noisy and crowded, making it difficult to have a conversation. The food was fine, but the atmosphere detracted from the experience."
  },
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "While the food was good, I found the service to be somewhat inattentive.  They seemed understaffed, leading to long waits between courses."
  },
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "Ziba is a reliable choice for a quick and tasty meal in Adajan. The food is consistently good, and the prices are reasonable."
  },
  {
    "restaurant": "Ziba Restaurant, Adajan",
    "review": "We were disappointed with the quality of the vegetarian dishes. They lacked flavor and felt rushed. The non-vegetarian options seemed much better."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "The Royal Cafe is a Surat institution!  Their Masala Dosa is legendary, crispy and flavorful, and the service is always friendly and efficient."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "Decent place for a quick bite in Athwa.  The food was okay, nothing special, but the prices were reasonable.  Wouldn't go out of my way for it."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "Loved the ambiance! Very clean and nicely decorated.  The food was good too, especially their pav bhaji, but the service was a bit slow."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "Honestly, quite disappointed.  The food was cold and the chai was lukewarm.  Not worth the price at all."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "A reliable spot for breakfast in Athwa.  The idlis are soft and fluffy, and the filter coffee is strong and delicious.  Good value for money."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "The Royal Cafe is always busy, which speaks volumes.  The food is consistently good, and I appreciate the quick service even during peak hours."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "While the food was tasty, the portions were quite small for the price.  It felt a little overpriced for what we got."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "I've been going to The Royal Cafe for years, and the quality has remained consistently high.  Highly recommend their South Indian dishes."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "The ambiance is a bit dated, but it's clean and comfortable enough.  The food is average, nothing exceptional, but it's a convenient location."
  },
  {
    "restaurant": "The Royal Cafe, Athwa",
    "review": "Had a terrible experience.  Our order was wrong, and the staff were unhelpful and rude when we tried to rectify it.  Avoid this place."
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "Coffee Culture Vesu is a great spot for a quick coffee and pastry. The pastries are fresh and delicious, and the service is always friendly and efficient.  Good value for money too!"
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "The ambiance at Coffee Culture is quite pleasant, perfect for a relaxed meeting or some quiet work. However, the coffee itself was a bit weak and underwhelming for the price."
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "I loved the atmosphere; it's cozy and inviting.  The service was a little slow, but the food made up for it - their sandwiches are amazing!"
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "Honestly, I was disappointed.  The food was overpriced for the quality, and the service was quite inattentive.  Wouldn't rush back."
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "Decent place for a coffee break. Nothing exceptional about the food or service, but it's clean and conveniently located.  Average experience overall."
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "Excellent coffee!  Strong, flavorful, and perfectly made.  The staff were incredibly helpful and friendly, creating a welcoming atmosphere."
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "The cafe has a nice modern design, but it can get quite noisy when it's busy. My cappuccino was good, but the cake I ordered was dry."
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "I had a fantastic experience at Coffee Culture Vesu. The food was delicious, the service was quick and attentive, and the overall atmosphere was very pleasant.  Highly recommend!"
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "A bit pricey compared to other cafes in Surat, but the quality of the ingredients and the taste of the coffee justified the cost for me.  I'd go back."
  },
  {
    "restaurant": "Coffee Culture, Vesu",
    "review": "The service was incredibly slow, and my order was incorrect.  The coffee was okay, but the overall experience was disappointing considering the reputation."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "The food at Jugaad Nights was surprisingly delicious!  The portions were generous, and the prices were very reasonable for the quality."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "Ambiance was lively and fun, perfect for a group outing.  Service was a bit slow, though, even when the restaurant wasn't overly crowded."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "While the concept is unique, the food itself was just average. Nothing particularly stood out, and I wouldn't rush back."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "Excellent service! Our server was attentive and friendly, making the whole experience enjoyable. The food was good, but not exceptional."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "Jugaad Nights offers a great value for money. The food is tasty, and the prices are affordable, especially considering the fun atmosphere."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "The music was a bit too loud for comfortable conversation.  The food was okay, but nothing special to warrant another visit."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "Loved the innovative dishes and the quirky decor!  A refreshing change from typical restaurants in Surat. Definitely recommend it."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "I found the food to be quite oily and the service somewhat inattentive.  It was a disappointing experience overall."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "A fun place for a casual dinner with friends. The food is decent, nothing amazing, but the atmosphere makes up for it."
  },
  {
    "restaurant": "Jugaad Nights, Vesu",
    "review": "The presentation of the dishes was impressive.  However, the taste didn't quite live up to the visual appeal; it was a bit underwhelming."
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "The tomatoes here are always fresh and juicy!  Great value for the price, and the staff are friendly and helpful."
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "Decent place to pick up tomatoes. Nothing special, but they're consistently good quality and reasonably priced."
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "I was disappointed with the tomatoes today. They were a bit bruised and not as ripe as I expected for the price."
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "Love this place!  The selection of tomatoes is amazing, and they always seem to have exactly what I need.  Highly recommend!"
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "The service is quick and efficient, which is appreciated when you're just grabbing a few tomatoes on your way home."
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "While the tomatoes are okay, the overall experience is nothing to write home about.  It's just a basic vegetable stall."
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "I've been coming here for years.  The quality of their tomatoes is consistently good, and the price is fair.  They're my go-to for tomatoes."
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "The tomatoes were surprisingly tasteless. I've had better quality at the local market for a lower price."
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "A very simple setup, but the tomatoes are always fresh and well-priced.  They know their produce!"
  },
  {
    "restaurant": "Tomatoes, Piplod",
    "review": "Had a less than pleasant experience.  The staff was unhelpful and the tomatoes I bought weren't very ripe, resulting in a waste of money."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "The food at Level 5 was surprisingly delicious!  The presentation was beautiful and the flavors were unique. Definitely worth a visit."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "Service was a bit slow, even though the restaurant wasn't overly crowded.  The food itself was good, but the wait detracted from the experience."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "Level 5 has a fantastic ambiance; very stylish and modern.  However, the prices are quite high for what you get."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "Excellent food and great service!  We had a wonderful evening celebrating a birthday there, the staff were very attentive."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "I found the food to be average, nothing particularly special.  The ambiance was nice, though, so it was a pleasant enough evening."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "The cocktails were amazing!  However, the main courses were a bit disappointing and lacked flavor.  Ambiance was great though."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "While the restaurant is beautifully designed, the noise level was quite high, making conversation difficult. The food was decent."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "Overall a good experience. The food was tasty and well-prepared, and the service was efficient.  A bit pricey, but worth it for a special occasion."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "I was extremely disappointed with the service. Our server was inattentive and our order was wrong. The food was okay, but not enough to make up for it."
  },
  {
    "restaurant": "Level 5, Vesu",
    "review": "The view from Level 5 is stunning!  The food was good, a little pricey, but the overall experience was elevated by the location and ambiance."
  }
]